src/Catalogs/ВерсииДополнений/ВерсииДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииДополнений</name>
  <owners>Catalog.Дополнения</owners>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыРасширений/ТипыРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасширений</name>
  <enumValues>
    <name>Исправление</name>
  </enumValues>
  <enumValues>
    <name>Доработка</name>
  </enumValues>
  <enumValues>
    <name>ТестированиеНаПроде</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <predefined>
    <items>
      <name>Финансы1С</name>
      <description>Финансы 1 С</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбновления</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКонвейерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБазыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогическаяПодсистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGitEDT</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаПоУмолчаниюЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеАвторы</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШагиКонвейера</name>
    <attributes>
      <name>ДействиеКонвейераОбработки</name>
      <type>
        <types>CatalogRef.ДействияКонвейераОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТестовыеБазы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыЗапускаИнтеграционныхТестов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВерсииДополнений/Forms/ФормаГенератораИмениВерсииРасширения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ОткрытьСтандарт.Заголовок = "https://bookstack.int.vkusvill.ru/books/pravila-razrabotki-na-proekte-vv/page/vv-std-0010-trebovaniya-k-rassireniyam";
	
	Шаблон = "{Исправление|Доработка}_{КодКонфигурации}_{КодАвтора}_{Команда}_{[{ДоYYYYMMDD}]/[Постоянное]}[_{НомерЗадачи}][_v[НомерВерсии]][_{Описание}]";
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Тип расширения";
	СтрокаШаблона.Ключ = "ТипРасширения";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = Перечисления.ТипыРасширений.Исправление;
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Код конфигурации";
	СтрокаШаблона.Ключ = "КодКонфигурации";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = Справочники.Конфигурации.ПустаяСсылка();
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Код автора";
	СтрокаШаблона.Ключ = "КодАвтора";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = Справочники.Пользователи.ПустаяСсылка();
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Команда";
	СтрокаШаблона.Ключ = "Команда";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = Справочники.Команды.ПустаяСсылка();
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Дата актуальности";
	СтрокаШаблона.Ключ = "ДатаАктуальности";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = '00010101';
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Номер задачи";
	СтрокаШаблона.Ключ = "НомерЗадачи";
	СтрокаШаблона.Обязательный = Истина;
	СтрокаШаблона.Значение = Справочники.ЗадачиМетеор.ПустаяСсылка();
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Версия";
	СтрокаШаблона.Ключ = "НомерВерсии";
	СтрокаШаблона.Обязательный = Ложь;
	СтрокаШаблона.Значение = "";
	
	СтрокаШаблона = СоставШаблона.Добавить();
	СтрокаШаблона.Описание = "Описание";
	СтрокаШаблона.Ключ = "Описание";
	СтрокаШаблона.Обязательный = Ложь;
	СтрокаШаблона.Значение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СоставШаблонаПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставШаблона

&НаКлиенте
Процедура СоставШаблонаПриИзменении(Элемент)
	
	Части = Новый Массив;
	
	Для Каждого СтрокаШаблона Из СоставШаблона Цикл
		
		Если ТипЗнч(СтрокаШаблона.Значение) = Тип("СправочникСсылка.Пользователи") Тогда
			Значение = ПолучитьКодПользователя(СтрокаШаблона.Значение);
		ИначеЕсли ТипЗнч(СтрокаШаблона.Значение) = Тип("СправочникСсылка.Конфигурации") Тогда
			Значение = ПолучитьИдКонфигурации(СтрокаШаблона.Значение);
		ИначеЕсли ТипЗнч(СтрокаШаблона.Значение) = Тип("СправочникСсылка.Команды") Тогда
			Значение = ПолучитьИдентификаторКоманды(СтрокаШаблона.Значение);
		ИначеЕсли ТипЗнч(СтрокаШаблона.Значение) = Тип("Дата") Тогда
			Если ЗначениеЗаполнено(СтрокаШаблона.Значение) Тогда
				Значение = "До" + Формат(СтрокаШаблона.Значение, "ЧГ=; ДФ=yyyyMMdd");
			ИначеЕсли СтрокаШаблона.Обязательный Тогда
				Значение = "Постоянное";
			Иначе
				Значение = "";
			КонецЕсли;
		ИначеЕсли СтрокаШаблона.Ключ = "НомерВерсии" И ЗначениеЗаполнено(СтрокаШаблона.Значение) Тогда
			Значение = "v" + СтрокаШаблона.Значение;
		Иначе
			Значение = Строка(СтрокаШаблона.Значение);
		КонецЕсли;
		СтрокаШаблона.ПредставлениеЗначения = Строка(Значение);
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Части.Добавить(Значение);
		ИначеЕсли СтрокаШаблона.Обязательный Тогда
			Части.Добавить("Null");
		КонецЕсли;
		
	КонецЦикла;
	
	ИмяВерсииДополнения = СтрСоединить(Части, "_");
	
	УдалитьНедопустимыеСимволы(ИмяВерсииДополнения);
	
	ИмяВерсииДополнения = Лев(ИмяВерсииДополнения, 80);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтандарт(Команда)
	НачатьЗапускПриложения(Новый ОписаниеОповещения, Элементы.ОткрытьСтандарт.Заголовок);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКодПользователя(Пользователь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Код");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдКонфигурации(Конфигурация)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конфигурация, "Идентификатор");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторКоманды(Команда)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Команда, "Наименование");
КонецФункции

&НаКлиенте
Процедура УдалитьНедопустимыеСимволы(Строка) Экспорт
	НедопустимыеСимволы = " ""'`/\[]{}:;|-=?*<>,.()+#№@!%^&~«»";
	Строка = СтрСоединить(СтрРазделить(Строка, НедопустимыеСимволы, Ложь));
КонецПроцедуры

#КонецОбласти
